RTEMS/rtems/bsps/arm/tms570/include/bsp/tms570lc4357-pins.h
#define TMS570_BALL_R8 TMS570_BALL_WITH_MMR(17, 0)
#define TMS570_BALL_R8_ETMDATA_31 TMS570_PIN_AND_FNC(TMS570_BALL_R8, 0)
#define TMS570_BALL_R8_EMIF_DATA_15 TMS570_PIN_AND_FNC(TMS570_BALL_R8, 1)
#define TMS570_BALL_R8_HET2_31 TMS570_PIN_AND_FNC(TMS570_BALL_R8, 2)
#define TMS570_BALL_R8_GIOA_4 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_R8, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_4, 1))

#define TMS570_BALL_R9 TMS570_BALL_WITH_MMR(17, 1)
#define TMS570_BALL_R9_ETMTRACECLKIN TMS570_PIN_AND_FNC(TMS570_BALL_R9, 0)
#define TMS570_BALL_R9_EXTCLKIN2 TMS570_PIN_AND_FNC(TMS570_BALL_R9, 1)
#define TMS570_BALL_R9_GIOA_5 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_R9, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_5, 1))

#define TMS570_BALL_R10 TMS570_BALL_WITH_MMR(17, 2)
#define TMS570_BALL_R10_ETMTRACECLKOUT TMS570_PIN_AND_FNC(TMS570_BALL_R10, 0)
#define TMS570_BALL_R10_GIOA_6 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_R10, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_6, 1))

#define TMS570_BALL_R11 TMS570_BALL_WITH_MMR(17, 3)
#define TMS570_BALL_R11_ETMTRACECTL TMS570_PIN_AND_FNC(TMS570_BALL_R11, 0)
#define TMS570_BALL_R11_GIOA_7 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_R11, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_7, 1))

#define TMS570_BALL_B15 TMS570_BALL_WITH_MMR(18, 0)
#define TMS570_BALL_B15_FRAYTX1 TMS570_PIN_AND_FNC(TMS570_BALL_B15, 0)
#define TMS570_BALL_B15_GIOA_2 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B15, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_2, 1))

#define TMS570_BALL_B8 TMS570_BALL_WITH_MMR(18, 1)
#define TMS570_BALL_B8_FRAYTX2 TMS570_PIN_AND_FNC(TMS570_BALL_B8, 0)
#define TMS570_BALL_B8_GIOB_0 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B8, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOB_0, 1))

#define TMS570_BALL_B16 TMS570_BALL_WITH_MMR(18, 2)
#define TMS570_BALL_B16_FRAYTXEN1 TMS570_PIN_AND_FNC(TMS570_BALL_B16, 0)
#define TMS570_BALL_B16_GIOB_1 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B16, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOB_1, 1))

#define TMS570_BALL_B9 TMS570_BALL_WITH_MMR(18, 3)
#define TMS570_BALL_B9_FRAYTXEN2 TMS570_PIN_AND_FNC(TMS570_BALL_B9, 0)
#define TMS570_BALL_B9_GIOB_2 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B9, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOB_2, 1))

#define TMS570_BALL_C1 TMS570_BALL_WITH_MMR(19, 0)
#define TMS570_BALL_C1_GIOA_2 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_C1, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_2, 0))
#define TMS570_BALL_C1_HET2_00 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_C1, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_00, 1))
#define TMS570_BALL_C1_eQEP2I TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_C1, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_eQEP2I, 1))

#define TMS570_BALL_E1 TMS570_BALL_WITH_MMR(19, 1)
#define TMS570_BALL_E1_GIOA_3 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_E1, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_3, 0))
#define TMS570_BALL_E1_HET2_02 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_E1, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_02, 1))

#define TMS570_BALL_B5 TMS570_BALL_WITH_MMR(19, 2)
#define TMS570_BALL_B5_GIOA_5 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B5, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_5, 0))
#define TMS570_BALL_B5_EXTCLKIN TMS570_PIN_AND_FNC(TMS570_BALL_B5, 3)
#define TMS570_BALL_B5_ePWM1A TMS570_PIN_AND_FNC(TMS570_BALL_B5, 5)

#define TMS570_BALL_H3 TMS570_BALL_WITH_MMR(19, 3)
#define TMS570_BALL_H3_GIOA_6 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_H3, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_6, 0))
#define TMS570_BALL_H3_HET2_04 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_H3, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_04, 1))
#define TMS570_BALL_H3_ePWM1B TMS570_PIN_AND_FNC(TMS570_BALL_H3, 5)

#define TMS570_BALL_M1 TMS570_BALL_WITH_MMR(20, 0)
#define TMS570_BALL_M1_GIOA_7 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_M1, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOA_7, 0))
#define TMS570_BALL_M1_HET2_06 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_M1, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_06, 1))
#define TMS570_BALL_M1_ePWM2A TMS570_PIN_AND_FNC(TMS570_BALL_M1, 5)

#define TMS570_BALL_F2 TMS570_BALL_WITH_MMR(20, 1)
#define TMS570_BALL_F2_GIOB_2 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_F2, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOB_2, 0))
#define TMS570_BALL_F2_DCAN4TX TMS570_PIN_AND_FNC(TMS570_BALL_F2, 3)

#define TMS570_BALL_W10 TMS570_BALL_WITH_MMR(20, 2)
#define TMS570_BALL_W10_GIOB_3 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_W10, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOB_3, 0))
#define TMS570_BALL_W10_DCAN4RX TMS570_PIN_AND_FNC(TMS570_BALL_W10, 3)

#define TMS570_BALL_J2 TMS570_BALL_WITH_MMR(20, 3)
#define TMS570_BALL_J2_GIOB_6 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_J2, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOB_6, 0))
#define TMS570_BALL_J2_nERROR1 TMS570_PIN_AND_FNC(TMS570_BALL_J2, 1)

#define TMS570_BALL_F1 TMS570_BALL_WITH_MMR(21, 0)
#define TMS570_BALL_F1_GIOB_7 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_F1, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_GIOB_7, 0))
#define TMS570_BALL_F1_nERROR2 TMS570_PIN_AND_FNC(TMS570_BALL_F1, 1)
#define TMS570_BALL_F1_nTZ1_2 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_F1, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_nTZ1_2, 0))

#define TMS570_BALL_R2 TMS570_BALL_WITH_MMR(21, 1)
#define TMS570_BALL_R2_MIBSPI1NCS_0 TMS570_PIN_AND_FNC(TMS570_BALL_R2, 0)
#define TMS570_BALL_R2_MIBSPI1SOMI_1 TMS570_PIN_AND_FNC(TMS570_BALL_R2, 1)
#define TMS570_BALL_R2_MII_TXD_2 TMS570_PIN_AND_FNC(TMS570_BALL_R2, 2)
#define TMS570_BALL_R2_ECAP6 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_R2, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_ECAP6, 1))

