RTEMS/rtems/bsps/arm/tms570/include/bsp/tms570lc4357-pins.h
#define TMS570_BALL_F3 TMS570_BALL_WITH_MMR(21, 2)
#define TMS570_BALL_F3_MIBSPI1NCS_1 TMS570_PIN_AND_FNC(TMS570_BALL_F3, 0)
#define TMS570_BALL_F3_MII_COL TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_F3, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_COL, 1))
#define TMS570_BALL_F3_HET1_17 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_F3, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_17, 1))
#define TMS570_BALL_F3_eQEP1S TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_F3, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_eQEP1S, 1))

#define TMS570_BALL_G3 TMS570_BALL_WITH_MMR(21, 3)
#define TMS570_BALL_G3_MIBSPI1NCS_2 TMS570_PIN_AND_FNC(TMS570_BALL_G3, 0)
#define TMS570_BALL_G3_MDIO TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_G3, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MDIO, 1))
#define TMS570_BALL_G3_HET1_19 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_G3, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_19, 1))

#define TMS570_BALL_J3 TMS570_BALL_WITH_MMR(22, 0)
#define TMS570_BALL_J3_MIBSPI1NCS_3 TMS570_PIN_AND_FNC(TMS570_BALL_J3, 0)
#define TMS570_BALL_J3_HET1_21 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_J3, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_21, 1))
#define TMS570_BALL_J3_nTZ1_3 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_J3, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_nTZ1_3, 0))

#define TMS570_BALL_G19 TMS570_BALL_WITH_MMR(22, 1)
#define TMS570_BALL_G19_MIBSPI1NENA TMS570_PIN_AND_FNC(TMS570_BALL_G19, 0)
#define TMS570_BALL_G19_MII_RXD_2 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_G19, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_RXD_2, 1))
#define TMS570_BALL_G19_HET1_23 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_G19, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_23, 1))
#define TMS570_BALL_G19_ECAP4 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_G19, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_ECAP4, 1))

#define TMS570_BALL_V9 TMS570_BALL_WITH_MMR(22, 2)
#define TMS570_BALL_V9_MIBSPI3CLK TMS570_PIN_AND_FNC(TMS570_BALL_V9, 0)
#define TMS570_BALL_V9_AD1EXT_SEL_01 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_V9, 1), \
                TMS570_PIN_AND_FNC(TMS570_BALL_H17, 4) | TMS570_PIN_CLEAR_RQ_MASK)
#define TMS570_BALL_V9_eQEP1A TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_V9, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_eQEP1A, 1))

#define TMS570_BALL_V10 TMS570_BALL_WITH_MMR(22, 3)
#define TMS570_BALL_V10_MIBSPI3NCS_0 TMS570_PIN_AND_FNC(TMS570_BALL_V10, 0)
#define TMS570_BALL_V10_AD2EVT TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_V10, 1), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_AD2EVT, 1))
#define TMS570_BALL_V10_eQEP1I TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_V10, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_eQEP1I, 1))

#define TMS570_BALL_V5 TMS570_BALL_WITH_MMR(23, 0)
#define TMS570_BALL_V5_MIBSPI3NCS_1 TMS570_PIN_AND_FNC(TMS570_BALL_V5, 0)
#define TMS570_BALL_V5_MDCLK TMS570_PIN_AND_FNC(TMS570_BALL_V5, 2)
#define TMS570_BALL_V5_HET1_25 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_V5, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_25, 1))

#define TMS570_BALL_B2 TMS570_BALL_WITH_MMR(23, 1)
#define TMS570_BALL_B2_MIBSPI3NCS_2 TMS570_PIN_AND_FNC(TMS570_BALL_B2, 0)
#define TMS570_BALL_B2_I2C1_SDA TMS570_PIN_AND_FNC(TMS570_BALL_B2, 1)
#define TMS570_BALL_B2_HET1_27 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B2, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_27, 1))
#define TMS570_BALL_B2_nTZ1_2 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B2, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_nTZ1_2, 1))

#define TMS570_BALL_C3 TMS570_BALL_WITH_MMR(23, 2)
#define TMS570_BALL_C3_MIBSPI3NCS_3 TMS570_PIN_AND_FNC(TMS570_BALL_C3, 0)
#define TMS570_BALL_C3_I2C1_SCL TMS570_PIN_AND_FNC(TMS570_BALL_C3, 1)
#define TMS570_BALL_C3_HET1_29 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_C3, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_29, 1))
#define TMS570_BALL_C3_nTZ1_1 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_C3, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_nTZ1_1, 1))

#define TMS570_BALL_W9 TMS570_BALL_WITH_MMR(23, 3)
#define TMS570_BALL_W9_MIBSPI3NENA TMS570_PIN_AND_FNC(TMS570_BALL_W9, 0)
#define TMS570_BALL_W9_MIBSPI3NCS_5 TMS570_PIN_AND_FNC(TMS570_BALL_W9, 1)
#define TMS570_BALL_W9_HET1_31 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_W9, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_31, 1))
#define TMS570_BALL_W9_eQEP1B TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_W9, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_eQEP1B, 1))

#define TMS570_BALL_W8 TMS570_BALL_WITH_MMR(24, 0)
#define TMS570_BALL_W8_MIBSPI3SIMO TMS570_PIN_AND_FNC(TMS570_BALL_W8, 0)
#define TMS570_BALL_W8_AD1EXT_SEL_00 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_W8, 1), \
                TMS570_PIN_AND_FNC(TMS570_BALL_E16, 4) | TMS570_PIN_CLEAR_RQ_MASK)
#define TMS570_BALL_W8_ECAP3 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_W8, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_ECAP3, 1))

#define TMS570_BALL_V8 TMS570_BALL_WITH_MMR(24, 1)
#define TMS570_BALL_V8_MIBSPI3SOMI TMS570_PIN_AND_FNC(TMS570_BALL_V8, 0)
#define TMS570_BALL_V8_EXT_ENA TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_V8, 1), \
                TMS570_PIN_AND_FNC(TMS570_BALL_G16, 4) | TMS570_PIN_CLEAR_RQ_MASK)
#define TMS570_BALL_V8_ECAP2 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_V8, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_ECAP2, 1))

