RTEMS/rtems/bsps/arm/tms570/include/bsp/tms570lc4357-pins.h
#define TMS570_BALL_E3 TMS570_BALL_WITH_MMR(30, 3)
#define TMS570_BALL_E3_HET1_11 TMS570_PIN_AND_FNC(TMS570_BALL_E3, 0)
#define TMS570_BALL_E3_MIBSPI3NCS_4 TMS570_PIN_AND_FNC(TMS570_BALL_E3, 1)
#define TMS570_BALL_E3_HET2_18 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_E3, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_18, 1))
#define TMS570_BALL_E3_EPWM1SYNCO TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_E3, 5), \
                TMS570_PIN_AND_FNC(TMS570_BALL_A4, 5) | TMS570_PIN_CLEAR_RQ_MASK)

#define TMS570_BALL_B4 TMS570_BALL_WITH_MMR(31, 0)
#define TMS570_BALL_B4_HET1_12 TMS570_PIN_AND_FNC(TMS570_BALL_B4, 0)
#define TMS570_BALL_B4_MIBSPI4NCS_5 TMS570_PIN_AND_FNC(TMS570_BALL_B4, 1)
#define TMS570_BALL_B4_MII_CRS TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B4, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_CRS, 1))
#define TMS570_BALL_B4_RMII_CRS_DV TMS570_PIN_AND_FNC(TMS570_BALL_B4, 3)

#define TMS570_BALL_N2 TMS570_BALL_WITH_MMR(31, 1)
#define TMS570_BALL_N2_HET1_13 TMS570_PIN_AND_FNC(TMS570_BALL_N2, 0)
#define TMS570_BALL_N2_SCI3TX TMS570_PIN_AND_FNC(TMS570_BALL_N2, 1)
#define TMS570_BALL_N2_HET2_20 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_N2, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_20, 1))
#define TMS570_BALL_N2_ePWM5B TMS570_PIN_AND_FNC(TMS570_BALL_N2, 5)

#define TMS570_BALL_N1 TMS570_BALL_WITH_MMR(31, 2)
#define TMS570_BALL_N1_HET1_15 TMS570_PIN_AND_FNC(TMS570_BALL_N1, 0)
#define TMS570_BALL_N1_MIBSPI1NCS_4 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_N1, 1), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MIBSPI1NCS_4, 1))
#define TMS570_BALL_N1_HET2_22 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_N1, 3), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_22, 1))
#define TMS570_BALL_N1_ECAP1 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_N1, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_ECAP1, 1))

#define TMS570_BALL_A4 TMS570_BALL_WITH_MMR(31, 3)
#define TMS570_BALL_A4_HET1_16 TMS570_PIN_AND_FNC(TMS570_BALL_A4, 0)
#define TMS570_BALL_A4_EPWM1SYNCI TMS570_PIN_AND_FNC(TMS570_BALL_A4, 3)
#define TMS570_BALL_A4_EPWM1SYNCO TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_A4, 5), \
                TMS570_PIN_AND_FNC(TMS570_BALL_E3, 5) | TMS570_PIN_CLEAR_RQ_MASK)

#define TMS570_BALL_A13 TMS570_BALL_WITH_MMR(32, 0)
#define TMS570_BALL_A13_HET1_17 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_A13, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_17, 0))
#define TMS570_BALL_A13_EMIF_nOE TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_A13, 1), \
                TMS570_PIN_AND_FNC(TMS570_BALL_E12, 1) | TMS570_PIN_CLEAR_RQ_MASK)
#define TMS570_BALL_A13_SCI4RX TMS570_PIN_AND_FNC(TMS570_BALL_A13, 2)

#define TMS570_BALL_J1 TMS570_BALL_WITH_MMR(32, 1)
#define TMS570_BALL_J1_HET1_18 TMS570_PIN_AND_FNC(TMS570_BALL_J1, 0)
#define TMS570_BALL_J1_EMIF_RNW TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_J1, 1), \
                TMS570_PIN_AND_FNC(TMS570_BALL_D17, 1) | TMS570_PIN_CLEAR_RQ_MASK)
#define TMS570_BALL_J1_ePWM6A TMS570_PIN_AND_FNC(TMS570_BALL_J1, 5)

#define TMS570_BALL_B13 TMS570_BALL_WITH_MMR(32, 2)
#define TMS570_BALL_B13_HET1_19 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B13, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_19, 0))
#define TMS570_BALL_B13_EMIF_nDQM_0 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B13, 1), \
                TMS570_PIN_AND_FNC(TMS570_BALL_E10, 1) | TMS570_PIN_CLEAR_RQ_MASK)
#define TMS570_BALL_B13_SCI4TX TMS570_PIN_AND_FNC(TMS570_BALL_B13, 2)

#define TMS570_BALL_P2 TMS570_BALL_WITH_MMR(32, 3)
#define TMS570_BALL_P2_HET1_20 TMS570_PIN_AND_FNC(TMS570_BALL_P2, 0)
#define TMS570_BALL_P2_EMIF_nDQM_1 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_P2, 1), \
                TMS570_PIN_AND_FNC(TMS570_BALL_E11, 1) | TMS570_PIN_CLEAR_RQ_MASK)
#define TMS570_BALL_P2_ePWM6B TMS570_PIN_AND_FNC(TMS570_BALL_P2, 5)

#define TMS570_BALL_H4 TMS570_BALL_WITH_MMR(33, 0)
#define TMS570_BALL_H4_HET1_21 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_H4, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_21, 0))
#define TMS570_BALL_H4_EMIF_nDQM_2 TMS570_PIN_AND_FNC(TMS570_BALL_H4, 1)

#define TMS570_BALL_B3 TMS570_BALL_WITH_MMR(33, 1)
#define TMS570_BALL_B3_HET1_22 TMS570_PIN_AND_FNC(TMS570_BALL_B3, 0)
#define TMS570_BALL_B3_EMIF_nDQM_3 TMS570_PIN_AND_FNC(TMS570_BALL_B3, 1)

#define TMS570_BALL_J4 TMS570_BALL_WITH_MMR(33, 2)
#define TMS570_BALL_J4_HET1_23 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_J4, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET1_23, 0))
#define TMS570_BALL_J4_EMIF_BA_0 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_J4, 1), \
                TMS570_PIN_AND_FNC(TMS570_BALL_E13, 1) | TMS570_PIN_CLEAR_RQ_MASK)

#define TMS570_BALL_P1 TMS570_BALL_WITH_MMR(33, 3)
#define TMS570_BALL_P1_HET1_24 TMS570_PIN_AND_FNC(TMS570_BALL_P1, 0)
#define TMS570_BALL_P1_MIBSPI1NCS_5 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_P1, 1), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MIBSPI1NCS_5, 1))
#define TMS570_BALL_P1_MII_RXD_0 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_P1, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_RXD_0, 1))
#define TMS570_BALL_P1_RMII_RXD_0 TMS570_PIN_AND_FNC(TMS570_BALL_P1, 3)

#define TMS570_BALL_A14 TMS570_BALL_WITH_MMR(34, 0)
#define TMS570_BALL_A14_HET1_26 TMS570_PIN_AND_FNC(TMS570_BALL_A14, 0)
#define TMS570_BALL_A14_MII_RXD_1 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_A14, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_RXD_1, 1))
#define TMS570_BALL_A14_RMII_RXD_1 TMS570_PIN_AND_FNC(TMS570_BALL_A14, 3)

#define TMS570_BALL_K19 TMS570_BALL_WITH_MMR(34, 1)
#define TMS570_BALL_K19_HET1_28 TMS570_PIN_AND_FNC(TMS570_BALL_K19, 0)
#define TMS570_BALL_K19_MII_RXCLK TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_K19, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_RXCLK, 1))
#define TMS570_BALL_K19_RMII_REFCLK TMS570_PIN_AND_FNC(TMS570_BALL_K19, 3)

#define TMS570_BALL_B11 TMS570_BALL_WITH_MMR(34, 2)
#define TMS570_BALL_B11_HET1_30 TMS570_PIN_AND_FNC(TMS570_BALL_B11, 0)
#define TMS570_BALL_B11_MII_RX_DV TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B11, 2), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_RX_DV, 1))
#define TMS570_BALL_B11_eQEP2S TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_B11, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_eQEP2S, 1))

/// (TM) TODO: is this correct? LS3137ZWT uses TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(29, 3), 0)
///   Per the schematic, this pin (called MII_RX_DV / RX_DV) attaches to pad B11 and can select
///   between MII and RMII mode for the PHY. A pin like this is required for the lwip tms570 rtems port
#define TMS570_MMR_SELECT_GMII_SEL TMS570_BALL_B11_MII_RX_DV

#define TMS570_BALL_D8 TMS570_BALL_WITH_MMR(34, 3)
#define TMS570_BALL_D8_HET2_01 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_D8, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_01, 0))

#define TMS570_BALL_D7 TMS570_BALL_WITH_MMR(35, 0)
#define TMS570_BALL_D7_HET2_02 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_D7, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_02, 0))

#define TMS570_BALL_D3 TMS570_BALL_WITH_MMR(35, 1)
#define TMS570_BALL_D3_HET2_12 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_D3, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_12, 0))
#define TMS570_BALL_D3_MIBSPI2NENA TMS570_PIN_AND_FNC(TMS570_BALL_D3, 4)
#define TMS570_BALL_D3_MIBSPI2NCS_1 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_D3, 5), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MIBSPI2NCS_1, 1))

#define TMS570_BALL_D2 TMS570_BALL_WITH_MMR(35, 2)
#define TMS570_BALL_D2_HET2_13 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_D2, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_13, 0))
#define TMS570_BALL_D2_MIBSPI2SOMI TMS570_PIN_AND_FNC(TMS570_BALL_D2, 4)

