RTEMS/rtems/bsps/arm/tms570/include/bsp/tms570lc4357-pins.h
#define TMS570_BALL_D1 TMS570_BALL_WITH_MMR(35, 3)
#define TMS570_BALL_D1_HET2_14 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_D1, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_14, 0))
#define TMS570_BALL_D1_MIBSPI2SIMO TMS570_PIN_AND_FNC(TMS570_BALL_D1, 4)

#define TMS570_BALL_P4 TMS570_BALL_WITH_MMR(36, 0)
#define TMS570_BALL_P4_HET2_19 TMS570_PIN_AND_FNC(TMS570_BALL_P4, 0)
#define TMS570_BALL_P4_LIN2RX TMS570_PIN_AND_FNC(TMS570_BALL_P4, 1)

#define TMS570_BALL_T5 TMS570_BALL_WITH_MMR(36, 1)
#define TMS570_BALL_T5_HET2_20 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_T5, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_20, 0))
#define TMS570_BALL_T5_LIN2TX TMS570_PIN_AND_FNC(TMS570_BALL_T5, 1)

#define TMS570_BALL_T4 TMS570_BALL_WITH_MMR(36, 2)
#define TMS570_BALL_T4_MII_RXCLK TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_T4, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_RXCLK, 0))

#define TMS570_BALL_U7 TMS570_BALL_WITH_MMR(36, 3)
#define TMS570_BALL_U7_MII_TX_CLK TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_U7, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_MII_TX_CLK, 0))

#define TMS570_BALL_E2 TMS570_BALL_WITH_MMR(37, 0)
#define TMS570_BALL_E2_HET2_03 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_E2, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_03, 0))
#define TMS570_BALL_E2_MIBSPI2CLK TMS570_PIN_AND_FNC(TMS570_BALL_E2, 4)

#define TMS570_BALL_N3 TMS570_BALL_WITH_MMR(37, 1)
#define TMS570_BALL_N3_HET2_07 TMS570_PIN_WITH_IN_ALT( \
                TMS570_PIN_AND_FNC(TMS570_BALL_N3, 0), \
                TMS570_PIN_AND_FNC(TMS570_PIN_MMR_ALT_HET2_07, 0))
#define TMS570_BALL_N3_MIBSPI2NCS_0 TMS570_PIN_AND_FNC(TMS570_BALL_N3, 4)

#define TMS570_MMR_SELECT_MII_MODE \
  TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(160, 3), TMS570_PIN_FNC_CLEAR)
#define TMS570_MMR_SELECT_RMII_MODE \
  TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(160, 3), 0)

/* Default pinmux select */

#define TMS570LC4357_PINMMR_DEFAULT_INIT_LIST(per_pin_action, common_arg) \
  per_pin_action(common_arg, TMS570_BALL_D4_EMIF_ADDR_00) \
  per_pin_action(common_arg, TMS570_BALL_D5_EMIF_ADDR_01) \
  per_pin_action(common_arg, TMS570_BALL_C4_EMIF_ADDR_06) \
  per_pin_action(common_arg, TMS570_BALL_C5_EMIF_ADDR_07) \
  per_pin_action(common_arg, TMS570_BALL_C6_EMIF_ADDR_08) \
  per_pin_action(common_arg, TMS570_BALL_C7_EMIF_ADDR_09) \
  per_pin_action(common_arg, TMS570_BALL_C8_EMIF_ADDR_10) \
  per_pin_action(common_arg, TMS570_BALL_C9_EMIF_ADDR_11) \
  per_pin_action(common_arg, TMS570_BALL_C10_EMIF_ADDR_12) \
  per_pin_action(common_arg, TMS570_BALL_C11_EMIF_ADDR_13) \
  per_pin_action(common_arg, TMS570_BALL_C12_EMIF_ADDR_14) \
  per_pin_action(common_arg, TMS570_BALL_C13_EMIF_ADDR_15) \
  per_pin_action(common_arg, TMS570_BALL_D14_EMIF_ADDR_16) \
  per_pin_action(common_arg, TMS570_BALL_C14_EMIF_ADDR_17) \
  per_pin_action(common_arg, TMS570_BALL_D15_EMIF_ADDR_18) \
  per_pin_action(common_arg, TMS570_BALL_C15_EMIF_ADDR_19) \
  per_pin_action(common_arg, TMS570_BALL_C16_EMIF_ADDR_20) \
  per_pin_action(common_arg, TMS570_BALL_C17_EMIF_ADDR_21) \
  per_pin_action(common_arg, TMS570_BALL_D16_EMIF_BA_1) \
  per_pin_action(common_arg, TMS570_BALL_R4_EMIF_nCAS) \
  per_pin_action(common_arg, TMS570_BALL_N17_EMIF_nCS_0) \
  per_pin_action(common_arg, TMS570_BALL_L17_EMIF_nCS_2) \
  per_pin_action(common_arg, TMS570_BALL_K17_EMIF_nCS_3) \
  per_pin_action(common_arg, TMS570_BALL_M17_EMIF_nCS_4) \
  per_pin_action(common_arg, TMS570_BALL_R3_EMIF_nRAS) \
  per_pin_action(common_arg, TMS570_BALL_P3_EMIF_nWAIT) \
  per_pin_action(common_arg, TMS570_BALL_D17_EMIF_nWE) \
  per_pin_action(common_arg, TMS570_BALL_E9_EMIF_ADDR_05) \
  per_pin_action(common_arg, TMS570_BALL_E8_EMIF_ADDR_04) \
  per_pin_action(common_arg, TMS570_BALL_E7_EMIF_ADDR_03) \
  per_pin_action(common_arg, TMS570_BALL_E6_EMIF_ADDR_02) \
  per_pin_action(common_arg, TMS570_BALL_E13_EMIF_BA_0) \
  per_pin_action(common_arg, TMS570_BALL_E12_EMIF_nOE) \
  per_pin_action(common_arg, TMS570_BALL_E11_EMIF_nDQM_1) \
  per_pin_action(common_arg, TMS570_BALL_E10_EMIF_nDQM_0) \
  per_pin_action(common_arg, TMS570_BALL_K15_EMIF_DATA_00) \
  per_pin_action(common_arg, TMS570_BALL_L15_EMIF_DATA_01) \
  per_pin_action(common_arg, TMS570_BALL_M15_EMIF_DATA_02) \
  per_pin_action(common_arg, TMS570_BALL_N15_EMIF_DATA_03) \
  per_pin_action(common_arg, TMS570_BALL_E5_EMIF_DATA_04) \
  per_pin_action(common_arg, TMS570_BALL_F5_EMIF_DATA_05) \
  per_pin_action(common_arg, TMS570_BALL_G5_EMIF_DATA_06) \
  per_pin_action(common_arg, TMS570_BALL_K5_EMIF_DATA_07) \
  per_pin_action(common_arg, TMS570_BALL_L5_EMIF_DATA_08) \
  per_pin_action(common_arg, TMS570_BALL_M5_EMIF_DATA_09) \
  per_pin_action(common_arg, TMS570_BALL_N5_EMIF_DATA_10) \
  per_pin_action(common_arg, TMS570_BALL_P5_EMIF_DATA_11) \
  per_pin_action(common_arg, TMS570_BALL_R5_EMIF_DATA_12) \
  per_pin_action(common_arg, TMS570_BALL_R6_EMIF_DATA_13) \
  per_pin_action(common_arg, TMS570_BALL_R7_EMIF_DATA_14) \
  per_pin_action(common_arg, TMS570_BALL_R8_EMIF_DATA_15) \
  per_pin_action(common_arg, TMS570_BALL_R9_ETMTRACECLKIN) \
  per_pin_action(common_arg, TMS570_BALL_R10_ETMTRACECLKOUT) \
  per_pin_action(common_arg, TMS570_BALL_R11_ETMTRACECTL) \
  per_pin_action(common_arg, TMS570_BALL_B15_FRAYTX1) \
  per_pin_action(common_arg, TMS570_BALL_B8_FRAYTX2) \
  per_pin_action(common_arg, TMS570_BALL_B16_FRAYTXEN1) \
  per_pin_action(common_arg, TMS570_BALL_B9_FRAYTXEN2) \
  per_pin_action(common_arg, TMS570_BALL_C1_GIOA_2) \
  per_pin_action(common_arg, TMS570_BALL_E1_GIOA_3) \
  per_pin_action(common_arg, TMS570_BALL_B5_GIOA_5) \
  per_pin_action(common_arg, TMS570_BALL_H3_GIOA_6) \
  per_pin_action(common_arg, TMS570_BALL_M1_GIOA_7) \
  per_pin_action(common_arg, TMS570_BALL_F2_GIOB_2) \
  per_pin_action(common_arg, TMS570_BALL_W10_GIOB_3) \
  per_pin_action(common_arg, TMS570_BALL_J2_GIOB_6) \
  per_pin_action(common_arg, TMS570_BALL_F1_GIOB_7) \
  per_pin_action(common_arg, TMS570_BALL_R2_MIBSPI1NCS_0) \
  per_pin_action(common_arg, TMS570_BALL_F3_MIBSPI1NCS_1) \
  per_pin_action(common_arg, TMS570_BALL_G3_MIBSPI1NCS_2) \
  per_pin_action(common_arg, TMS570_BALL_J3_MIBSPI1NCS_3) \
  per_pin_action(common_arg, TMS570_BALL_G19_MIBSPI1NENA) \
  per_pin_action(common_arg, TMS570_BALL_V9_MIBSPI3CLK) \
  per_pin_action(common_arg, TMS570_BALL_V10_MIBSPI3NCS_0) \
  per_pin_action(common_arg, TMS570_BALL_V5_MIBSPI3NCS_1) \
  per_pin_action(common_arg, TMS570_BALL_B2_MIBSPI3NCS_2) \
  per_pin_action(common_arg, TMS570_BALL_C3_MIBSPI3NCS_3) \
  per_pin_action(common_arg, TMS570_BALL_W9_MIBSPI3NENA) \
  per_pin_action(common_arg, TMS570_BALL_W8_MIBSPI3SIMO) \
  per_pin_action(common_arg, TMS570_BALL_V8_MIBSPI3SOMI) \
  per_pin_action(common_arg, TMS570_BALL_H19_MIBSPI5CLK) \
  per_pin_action(common_arg, TMS570_BALL_E19_MIBSPI5NCS_0) \
  per_pin_action(common_arg, TMS570_BALL_B6_MIBSPI5NCS_1) \
  per_pin_action(common_arg, TMS570_BALL_W6_MIBSPI5NCS_2) \
  per_pin_action(common_arg, TMS570_BALL_T12_MIBSPI5NCS_3) \
  per_pin_action(common_arg, TMS570_BALL_H18_MIBSPI5NENA) \
  per_pin_action(common_arg, TMS570_BALL_J19_MIBSPI5SIMO_0) \
  per_pin_action(common_arg, TMS570_BALL_E16_MIBSPI5SIMO_1) \
  per_pin_action(common_arg, TMS570_BALL_H17_MIBSPI5SIMO_2) \
  per_pin_action(common_arg, TMS570_BALL_G17_MIBSPI5SIMO_3) \
  per_pin_action(common_arg, TMS570_BALL_J18_MIBSPI5SOMI_0) \
  per_pin_action(common_arg, TMS570_BALL_E17_MIBSPI5SOMI_1) \
  per_pin_action(common_arg, TMS570_BALL_H16_MIBSPI5SOMI_2) \
  per_pin_action(common_arg, TMS570_BALL_G16_MIBSPI5SOMI_3) \
  per_pin_action(common_arg, TMS570_BALL_K18_HET1_00) \
  per_pin_action(common_arg, TMS570_BALL_V2_HET1_01) \
  per_pin_action(common_arg, TMS570_BALL_W5_HET1_02) \
  per_pin_action(common_arg, TMS570_BALL_U1_HET1_03) \
  per_pin_action(common_arg, TMS570_BALL_B12_HET1_04) \
  per_pin_action(common_arg, TMS570_BALL_V6_HET1_05) \
  per_pin_action(common_arg, TMS570_BALL_W3_HET1_06) \
  per_pin_action(common_arg, TMS570_BALL_T1_HET1_07) \
  per_pin_action(common_arg, TMS570_BALL_E18_HET1_08) \
  per_pin_action(common_arg, TMS570_BALL_V7_HET1_09) \
  per_pin_action(common_arg, TMS570_BALL_D19_HET1_10) \
  per_pin_action(common_arg, TMS570_BALL_E3_HET1_11) \
  per_pin_action(common_arg, TMS570_BALL_B4_HET1_12) \
  per_pin_action(common_arg, TMS570_BALL_N2_HET1_13) \
  per_pin_action(common_arg, TMS570_BALL_N1_HET1_15) \
  per_pin_action(common_arg, TMS570_BALL_A4_HET1_16) \
  per_pin_action(common_arg, TMS570_BALL_A13_HET1_17) \
  per_pin_action(common_arg, TMS570_BALL_J1_HET1_18) \
  per_pin_action(common_arg, TMS570_BALL_B13_HET1_19) \
  per_pin_action(common_arg, TMS570_BALL_P2_HET1_20) \
  per_pin_action(common_arg, TMS570_BALL_H4_HET1_21) \
  per_pin_action(common_arg, TMS570_BALL_B3_HET1_22) \
  per_pin_action(common_arg, TMS570_BALL_J4_HET1_23) \
  per_pin_action(common_arg, TMS570_BALL_P1_HET1_24) \
  per_pin_action(common_arg, TMS570_BALL_A14_HET1_26) \
  per_pin_action(common_arg, TMS570_BALL_K19_HET1_28) \
  per_pin_action(common_arg, TMS570_BALL_B11_HET1_30) \
  per_pin_action(common_arg, TMS570_BALL_D8_HET2_01) \
  per_pin_action(common_arg, TMS570_BALL_D7_HET2_02) \
  per_pin_action(common_arg, TMS570_BALL_D3_HET2_12) \
  per_pin_action(common_arg, TMS570_BALL_D2_HET2_13) \
  per_pin_action(common_arg, TMS570_BALL_D1_HET2_14) \
  per_pin_action(common_arg, TMS570_BALL_P4_HET2_19) \
  per_pin_action(common_arg, TMS570_BALL_T5_HET2_20) \
  per_pin_action(common_arg, TMS570_BALL_T4_MII_RXCLK) \
  per_pin_action(common_arg, TMS570_BALL_U7_MII_TX_CLK) \
  per_pin_action(common_arg, TMS570_BALL_E2_HET2_03) \
  per_pin_action(common_arg, TMS570_BALL_N3_HET2_07) \
  per_pin_action(common_arg, TMS570_BALL_K3_EMIF_CLK) \
  per_pin_action(common_arg, TMS570_BALL_N19_MII_RX_ER) \
  per_pin_action(common_arg, TMS570_BALL_F3_MII_COL) \
  per_pin_action(common_arg, TMS570_BALL_E18_MII_TXD_3) \
  per_pin_action(common_arg, TMS570_BALL_R2_MII_TXD_2) \
  per_pin_action(common_arg, TMS570_BALL_J19_MII_TXD_1) \
  per_pin_action(common_arg, TMS570_BALL_J18_MII_TXD_0) \
  per_pin_action(common_arg, TMS570_BALL_H19_MII_TXEN) \
  per_pin_action(common_arg, TMS570_BALL_D19_MII_TX_CLK) \
  per_pin_action(common_arg, TMS570_BALL_B4_MII_CRS) \
  per_pin_action(common_arg, TMS570_BALL_K19_MII_RXCLK) \
  per_pin_action(common_arg, TMS570_BALL_H18_MII_RXD_3) \
  per_pin_action(common_arg, TMS570_BALL_G19_MII_RXD_2) \
  per_pin_action(common_arg, TMS570_BALL_A14_MII_RXD_1) \
  per_pin_action(common_arg, TMS570_BALL_P1_MII_RXD_0) \
  per_pin_action(common_arg, TMS570_BALL_B11_MII_RX_DV) \
  per_pin_action(common_arg, TMS570_BALL_G3_MDIO) \
  per_pin_action(common_arg, TMS570_BALL_V5_MDCLK)

/* End of default PINMMR list */

// Note EMIF Clock enable (EMIF_CKE) on Ball L3 has no alternate functions and is enabled by default

#endif /*LIBBSP_ARM_TMS570_TMS570LC4357_PINS_H*/
